comparison/client/new/resolve.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope
    xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
    xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
    xmlns:wsd="http://schemas.xmlsoap.org/ws/2005/04/discovery"
>
    <soap:Header>
        <wsa:To>urn:schemas-xmlsoap-org:ws:2005:04:discovery</wsa:To>
        <wsa:Action>http://schemas.xmlsoap.org/ws/2005/04/discovery/Resolve</wsa:Action>
        <wsa:MessageID>urn:uuid:246ffa93-7eeb-46fe-aaa8-3812e524b3b1</wsa:MessageID>
    </soap:Header>
    <soap:Body>
        <wsd:Resolve>
            <wsa:EndpointReference>
                <wsa:Address>urn:uuid:ca6b4c38-7270-45fc-b4aa-f9b0874c138e</wsa:Address>
            </wsa:EndpointReference>
        </wsd:Resolve>
    </soap:Body>
</soap:Envelope>
